Repository: legit-ninja/customer-referral-system
Catalog: languages/intersoccer-referral-*.po
Languages: de_de, fr_ch

source: Coach
de_de: Trainer
fr_ch: Entraîneur

source: Content Creator
de_de: Content-Ersteller
fr_ch: Créateur de contenu

source: Link copied!
de_de: Link kopiert!
fr_ch: Lien copié !

source: Error occurred
de_de: Ein Fehler ist aufgetreten
fr_ch: Une erreur s'est produite

source: Failed to copy
de_de: Kopieren fehlgeschlagen
fr_ch: Échec de la copie

source: Loading...
de_de: Laden...
fr_ch: Chargement...

source: Are you sure you want to clear all demo data? This action cannot be undone.
de_de: Sind Sie sicher, dass Sie alle Demo-Daten löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden.
fr_ch: Êtes-vous sûr de vouloir effacer toutes les données de démonstration ? Cette action ne peut pas être annulée.

source: Demo data populated successfully!
de_de: Demo-Daten erfolgreich hinzugefügt!
fr_ch: Données de démonstration ajoutées avec succès !

source: Demo data cleared successfully!
de_de: Demo-Daten erfolgreich gelöscht!
fr_ch: Données de démonstration supprimées avec succès !

source: An error occurred. Please try again.
de_de: Ein Fehler ist aufgetreten. Bitte versuchen Sie es erneut.
fr_ch: Une erreur s'est produite. Veuillez réessayer.

source: Your Weekly InterSoccer Report - %s
de_de: Ihr wöchentlicher InterSoccer-Bericht - %s
fr_ch: Votre rapport hebdomadaire InterSoccer - %s

source: New Partnership Connection!
de_de: Neue Partnerschaftsverbindung!
fr_ch: Nouvelle connexion de partenariat !

source: Partnership Update
de_de: Partnerschafts-Update
fr_ch: Mise à jour du partenariat

source: Coach Referral Code (Optional)
de_de: Trainer-Empfehlungscode (Optional)
fr_ch: Code de parrainage de l'entraîneur (Facultatif)

source: Support your favorite coach! Enter their referral code to give them credit for this purchase.
de_de: Unterstützen Sie Ihren Lieblingstrainer! Geben Sie seinen Empfehlungscode ein, um ihm für diesen Kauf Anerkennung zu geben.
fr_ch: Soutenez votre entraîneur préféré ! Entrez son code de parrainage pour lui accorder un crédit pour cet achat.

source: Apply Code
de_de: Code anwenden
fr_ch: Appliquer le code

source: Use Loyalty Points
de_de: Treuepunkte verwenden
fr_ch: Utiliser les points de fidélité

source: You have %s points available
de_de: Sie haben %s Punkte verfügbar
fr_ch: Vous avez %s points disponibles

source: Apply All
de_de: Alle anwenden
fr_ch: Appliquer tout

source: Apply All Available
de_de: Alle verfügbaren anwenden
fr_ch: Appliquer tous les disponibles

source: Or enter custom amount:
de_de: Oder benutzerdefinierten Betrag eingeben:
fr_ch: Ou entrez un montant personnalisé :

source: Invalid points amount.
de_de: Ungültiger Punktebetrag.
fr_ch: Montant de points invalide.

source: Points redemption cannot exceed your cart total.
de_de: Punkte-Einlösung kann Ihren Warenkorb-Gesamtbetrag nicht überschreiten.
fr_ch: L'échange de points ne peut pas dépasser le total de votre panier.

source: You can redeem up to your cart total or available points, whichever is less.
de_de: Sie können bis zu Ihrem Warenkorb-Gesamtbetrag oder verfügbaren Punkten einlösen, je nachdem welcher Betrag niedriger ist.
fr_ch: Vous pouvez échanger jusqu'au total de votre panier ou vos points disponibles, selon le montant le plus bas.

source: Points must be whole numbers only. Fractional values are not allowed.
de_de: Punkte müssen ganze Zahlen sein. Dezimalwerte sind nicht erlaubt.
fr_ch: Les points doivent être des nombres entiers uniquement. Les valeurs décimales ne sont pas autorisées.

source: You don't have enough points available.
de_de: Sie haben nicht genügend Punkte zur Verfügung.
fr_ch: Vous n'avez pas assez de points disponibles.

source: Please enter the number of credits to redeem.
de_de: Bitte geben Sie die Anzahl der einzulösenden Credits ein.
fr_ch: Veuillez entrer le nombre de crédits à échanger.

source: Customer redeemed %d referral credits.
de_de: Kunde hat %d Empfehlungscredits eingelöst.
fr_ch: Le client a échangé %d crédits de parrainage.

source: Referral Credits Discount
de_de: Empfehlungscredits-Rabatt
fr_ch: Réduction de crédits de parrainage

source: Deducted %d credits from customer balance. New balance: %d
de_de: %d Credits vom Kundenguthaben abgezogen. Neues Guthaben: %d
fr_ch: %d crédits déduits du solde du client. Nouveau solde : %d

source: Awarded %d bonus points to coach %s for referral code usage. New balance: %d
de_de: %d Bonuspunkte an Trainer %s für die Nutzung des Empfehlungscodes vergeben. Neues Guthaben: %d
fr_ch: %d points bonus attribués à l'entraîneur %s pour l'utilisation du code de parrainage. Nouveau solde : %d

source: Awarded %d points to coach %s for customer purchase (CHF %.2f). New balance: %d
de_de: %d Punkte an Trainer %s für Kundenkauf vergeben (CHF %.2f). Neues Guthaben: %d
fr_ch: %d points attribués à l'entraîneur %s pour l'achat du client (CHF %.2f). Nouveau solde : %d

source: Referral code applied! You will receive a discount from coach %s.
de_de: Empfehlungscode angewendet! Sie erhalten einen Rabatt von Trainer %s.
fr_ch: Code de parrainage appliqué ! Vous recevrez une réduction de l'entraîneur %s.

source: Coach Referral Discount
de_de: Trainer-Empfehlungsrabatt
fr_ch: Réduction de parrainage d'entraîneur

source: Points Discount
de_de: Punkte-Rabatt
fr_ch: Réduction de points

source: Insufficient points balance.
de_de: Unzureichendes Punkteguthaben.
fr_ch: Solde de points insuffisant.

source: Points redemption exceeds allowed limits.
de_de: Die Punkteeinlösung überschreitet die zulässigen Grenzen.
fr_ch: L'échange de points dépasse les limites autorisées.

source: Points discount cannot exceed order total.
de_de: Der Punkterabatt kann die Bestellsumme nicht überschreiten.
fr_ch: La réduction de points ne peut pas dépasser le total de la commande.

source: Redeemed %d points for %.2f CHF discount
de_de: %d Punkte für %.2f CHF Rabatt eingelöst
fr_ch: %d points échangés pour %.2f CHF de réduction

source: No events added yet
de_de: Noch keine Events hinzugefügt
fr_ch: Aucun événement ajouté pour l'instant

source: Add the events you coach so we can generate direct referral links for customers.
de_de: Fügen Sie die Events hinzu, die Sie coachen, damit wir direkte Empfehlungslinks für Kund:innen erzeugen können.
fr_ch: Ajoutez les événements que vous encadrez afin que nous puissions générer des liens de parrainage directs pour les clients.

source: Copy
de_de: Kopieren
fr_ch: Copier

source: Open
de_de: Öffnen
fr_ch: Ouvrir

source: Remove
de_de: Entfernen
fr_ch: Supprimer

source: Please enter at least two characters to search.
de_de: Bitte geben Sie mindestens zwei Zeichen ein, um zu suchen.
fr_ch: Veuillez saisir au moins deux caractères pour lancer la recherche.

source: Searching...
de_de: Suche läuft...
fr_ch: Recherche en cours...

source: No events found.
de_de: Keine Events gefunden.
fr_ch: Aucun événement trouvé.

source: Search failed. Please try again.
de_de: Suche fehlgeschlagen. Bitte versuchen Sie es erneut.
fr_ch: La recherche a échoué. Veuillez réessayer.

source: Event selected. Click "Request Event" to submit.
de_de: Event ausgewählt. Klicken Sie auf "Event anfordern", um fortzufahren.
fr_ch: Événement sélectionné. Cliquez sur "Demander l'événement" pour l'envoyer.

source: Please select an event before requesting.
de_de: Bitte wählen Sie zuerst ein Event aus, bevor Sie fortfahren.
fr_ch: Veuillez sélectionner un événement avant de l'envoyer.

source: Event request submitted. Awaiting approval.
de_de: Event-Anfrage gesendet. Wartet auf Freigabe.
fr_ch: Demande d'événement envoyée. En attente de validation.

source: Unable to request event.
de_de: Event-Anfrage konnte nicht gesendet werden.
fr_ch: Impossible d'envoyer la demande d'événement.

source: Network error. Please try again.
de_de: Netzwerkfehler. Bitte versuchen Sie es erneut.
fr_ch: Erreur réseau. Veuillez réessayer.

source: Event link copied to clipboard!
de_de: Event-Link wurde in die Zwischenablage kopiert!
fr_ch: Lien de l'événement copié dans le presse-papiers !

source: Remove this event from your list?
de_de: Dieses Event aus Ihrer Liste entfernen?
fr_ch: Retirer cet événement de votre liste ?

source: Event removed.
de_de: Event entfernt.
fr_ch: Événement supprimé.

source: Unable to remove event.
de_de: Event konnte nicht entfernt werden.
fr_ch: Impossible de supprimer l'événement.

source: Unable to refresh events.
de_de: Events konnten nicht aktualisiert werden.
fr_ch: Impossible d'actualiser les événements.

source: Referral link copied to clipboard!
de_de: Empfehlungslink wurde in die Zwischenablage kopiert!
fr_ch: Lien de parrainage copié dans le presse-papiers !

source: Create Social Media Post
de_de: Social-Media-Beitrag erstellen
fr_ch: Créer une publication pour les réseaux sociaux

source: Instagram Post
de_de: Instagram-Beitrag
fr_ch: Publication Instagram

source: Transform your game with personalized soccer training! Join me at InterSoccer - link in bio!
de_de: Verbessere dein Spiel mit personalisiertem Soccer-Training! Komm zu InterSoccer - Link in der Bio!
fr_ch: Améliore ton jeu avec un coaching personnalisé ! Rejoins-moi chez InterSoccer - lien en bio !

source: Facebook Post
de_de: Facebook-Beitrag
fr_ch: Publication Facebook

source: Looking to improve your soccer skills? I'm now partnering with InterSoccer to offer personalized training programs. Click here to get started: %s
de_de: Du willst deine Fussball-Skills verbessern? Ich arbeite jetzt mit InterSoccer zusammen und biete personalisierte Trainingsprogramme an. Hier geht es los: %s
fr_ch: Tu veux progresser en football ? Je me suis associé avec InterSoccer pour proposer des programmes personnalisés. Clique ici pour commencer : %s

source: Twitter Post
de_de: Twitter-Beitrag
fr_ch: Publication Twitter

source: Level up your soccer game! Join InterSoccer for personalized training. Link: %s #SoccerTraining #InterSoccer
de_de: Bring dein Fussballspiel aufs nächste Level! Mach mit bei InterSoccer für personalisiertes Training. Link: %s #SoccerTraining #InterSoccer
fr_ch: Fais passer ton football au niveau supérieur ! Rejoins InterSoccer pour un coaching personnalisé. Lien : %s #SoccerTraining #InterSoccer

source: Copy Post
de_de: Beitrag kopieren
fr_ch: Copier la publication

source: Share Now
de_de: Jetzt teilen
fr_ch: Partager maintenant

source: Post copied to clipboard!
de_de: Beitrag wurde in die Zwischenablage kopiert!
fr_ch: Publication copiée dans le presse-papiers !

source: Post copied! Share it on your favorite social platform.
de_de: Beitrag kopiert! Teile ihn auf deiner bevorzugten Plattform.
fr_ch: Publication copiée ! Partage-la sur ton réseau préféré.

source: Send Referral Email
de_de: Empfehlungs-E-Mail senden
fr_ch: Envoyer l'e-mail de parrainage

source: Recipient Email
de_de: E-Mail-Adresse der Empfängerin/des Empfängers
fr_ch: Adresse e-mail du destinataire

source: friend@example.com
de_de: freund@example.ch
fr_ch: ami@example.ch

source: Subject
de_de: Betreff
fr_ch: Objet

source: Join me at InterSoccer!
de_de: Begleite mich zu InterSoccer!
fr_ch: Rejoins-moi chez InterSoccer !

source: Message
de_de: Nachricht

source: Hi there! I thought you'd be interested in InterSoccer's personalized soccer training programs. I've been really enjoying the coaching and wanted to share this opportunity with you. Click here to check it out: %1$s Best regards, %2$s
de_de: Hallo! Ich wollte dir die personalisierten Fussball-Trainings von InterSoccer empfehlen. Mir gefallen die Coachings sehr und ich möchte diese Chance mit dir teilen. Hier geht's zum Angebot: %1$s Beste Grüsse, %2$s
fr_ch: Bonjour ! J'aimerais te faire découvrir les programmes d'entraînement personnalisés d'InterSoccer. J'apprécie vraiment ce coaching et je voulais partager cette opportunité avec toi. Clique ici pour en savoir plus : %1$s À bientôt, %2$s

source: Send Email
de_de: E-Mail senden
fr_ch: Envoyer l'e-mail

source: Cancel
de_de: Abbrechen
fr_ch: Annuler

source: Sending...
de_de: Wird gesendet...
fr_ch: Envoi en cours...

source: Email sent successfully!
de_de: E-Mail erfolgreich gesendet!
fr_ch: E-mail envoyé avec succès !

source: Failed to send email
de_de: E-Mail konnte nicht gesendet werden
fr_ch: Échec de l'envoi de l'e-mail

source: Failed to send email. Please try again.
de_de: E-Mail-Versand fehlgeschlagen. Bitte versuchen Sie es erneut.
fr_ch: Échec de l'envoi de l'e-mail. Veuillez réessayer.

source: Contact Support
de_de: Support kontaktieren
fr_ch: Contacter le support

source: Get instant help from our support team
de_de: Erhalten Sie sofortige Hilfe von unserem Support-Team
fr_ch: Obtenez l'aide immédiate de notre équipe support

source: Start Chat
de_de: Chat starten
fr_ch: Lancer le chat

source: Send us a detailed message
de_de: Senden Sie uns eine ausführliche Nachricht
fr_ch: Envoyez-nous un message détaillé

source: Browse our knowledge base
de_de: Durchstöbern Sie unsere Wissensdatenbank
fr_ch: Consultez notre base de connaissances

source: View FAQ
de_de: FAQ anzeigen
fr_ch: Consulter la FAQ

source: Close modal
de_de: Modal schließen
fr_ch: Fermer la fenêtre

source: Referrals
de_de: Empfehlungen
fr_ch: Parrainages

source: Credits Earned
de_de: Gesammelte Guthaben
fr_ch: Crédits gagnés

source: Full Leaderboard
de_de: Gesamtrangliste
fr_ch: Classement complet

source: Loading leaderboard...
de_de: Rangliste wird geladen...
fr_ch: Chargement du classement...

source: You
de_de: Du
fr_ch: Vous

source: %1$s referrals • %2$s CHF
de_de: %1$s Empfehlungen • %2$s CHF
fr_ch: %1$s parrainages • %2$s CHF

source: Coach Referral Dashboard
de_de: Coach-Empfehlungs-Dashboard
fr_ch: Tableau de bord du parrainage coach

source: Total Credits: %s CHF
de_de: Gesamtguthaben: %s CHF
fr_ch: Total des crédits : %s CHF

source: Your Referral Link:
de_de: Ihr Empfehlungslink:
fr_ch: Votre lien de parrainage :

source: Recent Referrals
de_de: Neueste Empfehlungen
fr_ch: Parrainages récents

source: Order ID
de_de: Bestellnummer
fr_ch: N° de commande

source: Commission
de_de: Provision

source: Date
de_de: Datum

source: Welcome back, %s! 👋
de_de: Willkommen zurück, %s! 👋
fr_ch: Bon retour, %s ! 👋

source: Here's what's happening with your referral program today
de_de: Das passiert heute in Ihrem Empfehlungsprogramm
fr_ch: Voici l'actualité de votre programme de parrainage aujourd'hui

source: Share your referral link
de_de: Empfehlungslink teilen
fr_ch: Partager votre lien de parrainage

source: View detailed analytics
de_de: Detaillierte Analysen anzeigen
fr_ch: Afficher les analyses détaillées

source: Toggle theme
de_de: Theme wechseln
fr_ch: Changer de thème

source: Copy to clipboard
de_de: In die Zwischenablage kopieren
fr_ch: Copier dans le presse-papiers

source: Show QR code
de_de: QR-Code anzeigen
fr_ch: Afficher le code QR

source: Referral Link QR Code
de_de: QR-Code des Empfehlungslinks
fr_ch: Code QR du lien de parrainage

source: Scan this QR code to access your referral link.
de_de: Scannen Sie diesen QR-Code, um auf Ihren Empfehlungslink zuzugreifen.
fr_ch: Scannez ce code QR pour accéder à votre lien de parrainage.

source: Download QR Code
de_de: QR-Code herunterladen
fr_ch: Télécharger le code QR

source: Share QR Code
de_de: QR-Code teilen
fr_ch: Partager le code QR

source: Are you sure you want to select %s as your coach partner?
de_de: Möchten Sie %s wirklich als Coach-Partner:in auswählen?
fr_ch: Voulez-vous vraiment sélectionner %s comme coach partenaire ?

source: Refer & Earn
de_de: Empfehlen & verdienen
fr_ch: Parrainer et gagner

source: Partner
fr_ch: Partenaire

source: Live Chat
fr_ch: Chat en direct

source: Email Support
fr_ch: Support par e-mail
